In [0]:
import pandas as pd
from fbprophet import Prophet
from fbprophet.plot import add_changepoints_to_plot
from fbprophet.diagnostics import cross_validation
from fbprophet.diagnostics import performance_metrics
from fbprophet.plot import plot_cross_validation_metric
import matplotlib.pyplot as plt

In [0]:
from google.colab import drive
drive.mount('/content/gdrive')
df=pd.read_csv('gdrive/My Drive/Location.csv')

Drive already mounted at /content/gdrive; to attempt to forcibly remount, call drive.mount("/content/gdrive", force_remount=True).

In [0]:
df.head()

   Unnamed: 0            Date_Time  Category  Descript           X          Y
0      586698  2003-01-01 00:01:00        13       392 -122.413754  37.783730
1     1715286  2003-01-01 00:01:00         9       300 -122.443835  37.792137
2       90200  2003-01-01 00:01:00        28       212 -122.414190  37.747319
3     1713765  2003-01-01 00:01:00         1       443 -122.419971  37.767454
4     1488152  2003-01-01 00:01:00        12       207 -122.445418  37.712075

In [0]:
df.drop(['Unnamed: 0'], axis=1)

                   Date_Time  Category  Descript           X          Y
0        2003-01-01 00:01:00        13       392 -122.413754  37.783730
1        2003-01-01 00:01:00         9       300 -122.443835  37.792137
2        2003-01-01 00:01:00        28       212 -122.414190  37.747319
3        2003-01-01 00:01:00         1       443 -122.419971  37.767454
4        2003-01-01 00:01:00        12       207 -122.445418  37.712075
...                      ...       ...       ...         ...        ...
2215019  2018-05-15 02:01:00        21       810 -122.417813  37.757101
2215020  2018-05-15 02:01:00        21       537 -122.417813  37.757101
2215021  2018-05-15 02:01:00        21       811 -122.417813  37.757101
2215022  2018-05-15 04:14:00        20        24 -122.419258  37.775146
2215023  2018-05-15 10:30:00        36       748 -122.411912  37.775207

[2215024 rows x 5 columns]

In [0]:
catdf = df[['Date_Time','Category']].rename(columns={'Date_Time':'ds','Category':'y'})
desdf = df[['Date_Time','Descript']].rename(columns={'Date_Time':'ds','Descript':'y'})
xdf = df[['Date_Time','X']].rename(columns={'Date_Time':'ds','X':'y'})
ydf = df[['Date_Time','Y']].rename(columns={'Date_Time':'ds','Y':'y'})

In [0]:
prfcat = Prophet()
prfdes = Prophet()
prfx = Prophet()
prfy = Prophet()
prfcat.fit(catdf)
prfdes.fit(desdf)
prfx.fit(xdf)
prfy.fit(ydf)

INFO:numexpr.utils:NumExpr defaulting to 2 threads.

In [0]:
future = prfcat.make_future_dataframe(30*24*60,'min',False)
future

                       ds
0     2018-05-15 10:31:00
1     2018-05-15 10:32:00
2     2018-05-15 10:33:00
3     2018-05-15 10:34:00
4     2018-05-15 10:35:00
...                   ...
43195 2018-06-14 10:26:00
43196 2018-06-14 10:27:00
43197 2018-06-14 10:28:00
43198 2018-06-14 10:29:00
43199 2018-06-14 10:30:00

[43200 rows x 1 columns]

In [0]:
forcastcat = prfcat.predict(future)
forcastdes = prfdes.predict(future)
forcastx = prfx.predict(future)
forcasty = prfy.predict(future)
print(forcastcat[['ds','yhat']])
print(forcastdes[['ds','yhat']])
print(forcastx[['ds','yhat']])
print(forcasty[['ds','yhat']])

                       ds       yhat
0     2018-05-15 10:31:00  18.696970
1     2018-05-15 10:32:00  18.695471
2     2018-05-15 10:33:00  18.693971
3     2018-05-15 10:34:00  18.692470
4     2018-05-15 10:35:00  18.690967
...                   ...        ...
43195 2018-06-14 10:26:00  18.775919
43196 2018-06-14 10:27:00  18.774358
43197 2018-06-14 10:28:00  18.772798
43198 2018-06-14 10:29:00  18.771238
43199 2018-06-14 10:30:00  18.769678

[43200 rows x 2 columns]
                       ds        yhat
0     2018-05-15 10:31:00  450.169124
1     2018-05-15 10:32:00  450.155955
2     2018-05-15 10:33:00  450.143047
3     2018-05-15 10:34:00  450.130406
4     2018-05-15 10:35:00  450.118035
...                   ...         ...
43195 2018-06-14 10:26:00  449.105175
43196 2018-06-14 10:27:00  449.086320
43197 2018-06-14 10:28:00  449.067701
43198 2018-06-14 10:29:00  449.049325
43199 2018-06-14 10:30:00  449.031195

[43200 rows x 2 columns]
                       ds        yhat
0     2018-05-15 10:31:00 -122.425552
1     2018-05-15 10:32:00 -122.425553
2     2018-05-15 10:33:00 -122.425553
3     2018-05-15 10:34:00 -122.425553
4     2018-05-15 10:35:00 -122.425554
...                   ...         ...
43195 2018-06-14 10:26:00 -122.424848
43196 2018-06-14 10:27:00 -122.424849
43197 2018-06-14 10:28:00 -122.424850
43198 2018-06-14 10:29:00 -122.424851
43199 2018-06-14 10:30:00 -122.424852

[43200 rows x 2 columns]
                       ds       yhat
0     2018-05-15 10:31:00  37.767121
1     2018-05-15 10:32:00  37.767124
2     2018-05-15 10:33:00  37.767126
3     2018-05-15 10:34:00  37.767129
4     2018-05-15 10:35:00  37.767131
...                   ...        ...
43195 2018-06-14 10:26:00  37.767576
43196 2018-06-14 10:27:00  37.767577
43197 2018-06-14 10:28:00  37.767578
43198 2018-06-14 10:29:00  37.767579
43199 2018-06-14 10:30:00  37.767580

[43200 rows x 2 columns]

In [0]:
Forcasteddf=pd.DataFrame(columns=['Date_Time','Category','Descript','X','Y'])
Forcasteddf['Date_Time']=future['ds'].apply(lambda x:str(x))
Forcasteddf['Category']=forcastcat['yhat'].apply(lambda x:int(round(x,0)))
Forcasteddf['Descript']=forcastdes['yhat'].apply(lambda x:int(round(x,0)))
Forcasteddf['X']=forcastx['yhat']
Forcasteddf['Y']=forcasty['yhat']
Forcasteddf

                 Date_Time  Category  Descript           X          Y
0      2018-05-15 10:31:00        19       450 -122.425552  37.767121
1      2018-05-15 10:32:00        19       450 -122.425553  37.767124
2      2018-05-15 10:33:00        19       450 -122.425553  37.767126
3      2018-05-15 10:34:00        19       450 -122.425553  37.767129
4      2018-05-15 10:35:00        19       450 -122.425554  37.767131
...                    ...       ...       ...         ...        ...
43195  2018-06-14 10:26:00        19       449 -122.424848  37.767576
43196  2018-06-14 10:27:00        19       449 -122.424849  37.767577
43197  2018-06-14 10:28:00        19       449 -122.424850  37.767578
43198  2018-06-14 10:29:00        19       449 -122.424851  37.767579
43199  2018-06-14 10:30:00        19       449 -122.424852  37.767580

[43200 rows x 5 columns]

In [0]:
Forcasteddf.to_csv

<bound method NDFrame.to_csv of                  Date_Time  Category  Descript           X          Y
0      2018-05-15 10:31:00        19       450 -122.425552  37.767121
1      2018-05-15 10:32:00        19       450 -122.425553  37.767124
2      2018-05-15 10:33:00        19       450 -122.425553  37.767126
3      2018-05-15 10:34:00        19       450 -122.425553  37.767129
4      2018-05-15 10:35:00        19       450 -122.425554  37.767131
...                    ...       ...       ...         ...        ...
43195  2018-06-14 10:26:00        19       449 -122.424848  37.767576
43196  2018-06-14 10:27:00        19       449 -122.424849  37.767577
43197  2018-06-14 10:28:00        19       449 -122.424850  37.767578
43198  2018-06-14 10:29:00        19       449 -122.424851  37.767579
43199  2018-06-14 10:30:00        19       449 -122.424852  37.767580

[43200 rows x 5 columns]>